---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNumberOfSegments
source: html/4c6a69d1-b780-d654-e5a8-853320eef50f.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNumberOfSegments Method

Returns the number of analytical segments.

## Syntax (C#)
```csharp
public int GetNumberOfSegments()
```

## Returns
The total number of